a = ('Шляпка гриба, покрытая ... кожиц...й, держиться на ... ножк.. . Снизу шапка затянута плёнкой. Когда её уберешь, откроется нижняя ... сторона шляпк...')
print(a)

b = input('Введите пропущенное слово: покрытая ')

c = input('Введите пропущенную букву: кожиц...й')

d = input('Введите пропущенное слово: держится на ...')

e = input('Введите пропущенную букву: ножк...')

f = input('Введите пропущенное слово: нижняя ...')

g = input('Введите пропущенную букву: шляпк...')

print(f'Шляпка гриба, покрытая', b, 'кожиц' {c} 'й' ',', 'держиться на' , d, 'ножк' {e} '.', 'Снизу шапка затянута плёнкой. Когда её уберешь, откроется нижняя', f, 'сторона шляпк' {g})